import React, { Component } from 'react';
import './App.css';
import { Link } from "react-router-dom";

class Rules extends Component {
	render() {
		return (
			<div className="about-rules">
				<h2>Правила судоку</h2>
				<p>Игровое поле представляет собой квадрат размером 
				9×9, разделённый на меньшие квадраты со стороной в 3 
				клетки. Таким образом, всё игровое поле состоит из 81 
				клетки. В них уже в начале игры стоят некоторые числа 
				(от 1 до 9), называемые подсказками. От игрока требуется 
				заполнить свободные клетки цифрами от 1 до 9 так, чтобы в 
				каждой строке, в каждом столбце и в каждом малом квадрате 
				3×3 каждая цифра встречалась бы только один раз. Сложность 
				судоку зависит от количества изначально заполненных клеток 
				и от методов, которые нужно применять для её решения. 
				Самые простые решаются дедуктивно: всегда есть хотя бы 
				одна клетка, куда подходит только одно число. Некоторые 
				головоломки можно решить за несколько минут, на другие 
				можно потратить часы. Правильно составленная головоломка 
				имеет только одно решение. </p>
				<Link to="/">Вернуться к игре</Link>
			</div>
		)
	}
}

export default Rules;